<script setup>
import { ref } from 'vue'
import VipMovie from '@/components/VipMovie.vue'

components: {
  VipMovie
}

const movies = ref([
  {
    id: 1,
    title: 'Грань будущего',
    description:
      'В недалёком будущем раса инопланетян вторгается на Землю. Никакая армия в мире не может противостоять им. Майор Уильям Кейдж умирает в бою, но случается невозможное — он оказывается во временной петле. Раз за разом он попадает в один и тот же бой, сражается и умирает снова и снова. И каждое повторяющееся сражение приближает его к разгадке того, как победить врага.',
    genre: 'фантастика, боевик, приключения, военный',
    production: 'США, Канада',
    year: '2014',
    duration: '113',
  },
  {
    id: 2,
    title: 'Грань будущего',
    description:
      'В недалёком будущем раса инопланетян вторгается на Землю. Никакая армия в мире не может противостоять им. Майор Уильям Кейдж умирает в бою, но случается невозможное — он оказывается во временной петле. Раз за разом он попадает в один и тот же бой, сражается и умирает снова и снова. И каждое повторяющееся сражение приближает его к разгадке того, как победить врага.',
    genre: 'фантастика, боевик, приключения, военный',
    production: 'США, Канада',
    year: '2014',
    duration: '113',
  },
  {
    id: 3,
    title: 'Грань будущего',
    description:
      'В недалёком будущем раса инопланетян вторгается на Землю. Никакая армия в мире не может противостоять им. Майор Уильям Кейдж умирает в бою, но случается невозможное — он оказывается во временной петле. Раз за разом он попадает в один и тот же бой, сражается и умирает снова и снова. И каждое повторяющееся сражение приближает его к разгадке того, как победить врага.',
    genre: 'фантастика, боевик, приключения, военный',
    production: 'США, Канада',
    year: '2014',
    duration: '113',
  },
  {
    id: 4,
    title: 'Грань будущего',
    description:
      'В недалёком будущем раса инопланетян вторгается на Землю. Никакая армия в мире не может противостоять им. Майор Уильям Кейдж умирает в бою, но случается невозможное — он оказывается во временной петле. Раз за разом он попадает в один и тот же бой, сражается и умирает снова и снова. И каждое повторяющееся сражение приближает его к разгадке того, как победить врага.',
    genre: 'фантастика, боевик, приключения, военный',
    production: 'США, Канада',
    year: '2014',
    duration: '113',
  },
])
</script>

<template>
  <div class="movies">
    <VipMovie v-for="movie in movies" :key="movie.id" :movie="movie" />
  </div>
</template>

<style lang="sass" scoped>
.movies
  display: flex
  flex-direction: column
  align-items: center
  justify-content: center
  gap: calc(1vh * 2) calc(1vw * 3)
  width: $container-width
  max-width: 1200px
</style>
